test/artillery.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: https://cb5rx5uaf5vyjlvbo73cnrgpwi0dntik.lambda-url.ap-southeast-2.on.aws
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 30
      arrivalRate: 10
      rampTo: 30
      name: Spike phase
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
      thresholds:
        - http.response_time.p99: 150
        - http.response_time.p95: 125
scenarios:
  - flow:
      - loop:
        - get:
            url: "/?who=dino"
        - get:
            url: "/?who=pony"
        - get:
            url: "/?who=armadillo"
        count: 100